///начало доработки Барышникова Ю.А 08.11.2024
#Область ОписаниеПеременных
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если  НЕ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда  
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Ложь ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Ложь ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Ложь ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Ложь ; 
	Иначе 	
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Истина ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Истина ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Истина ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Истина ; 
	КонецЕсли ;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание И 
	    Не ЗначениеЗаполнено(Объект.ВКМ_НачалоДействияДоговора)Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана дата начала договора";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли ;

	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание И
		НЕ ЗначениеЗаполнено(Объект.ВКМ_КонецДействияДоговора) Тогда
		Сообщение = Новый СообщениеПользователю() ;
		Сообщение.Текст ="Не указана дата окончания договора" ;
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВКМ_НачалоДействияДоговора.Видимость =Ложь;
	Элементы.ВКМ_КонецДействияДоговора.Видимость =Ложь;
	Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =Ложь;
	Если Объект.ВидДоговора =  Перечисления .ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда  
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Истина ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Истина ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Истина ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Истина ; 
	КонецЕсли ;
КонецПроцедуры	
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти















