#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	ВыполнитьОбработку() ;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Обработка завершена";
	Сообщение.Сообщить();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыполнитьОбработку() 
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьГрафик(ВКМ_Период.ДатаНачала,ВКМ_Период.ДатаОкончания, ВКМ_ВыходныеДни);
   
КонецПроцедуры

#КонецОбласти