//Начало доработки Барышникова Ю.А 12.11.2024
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)   
	
	// регистр ВКМ_ПлановыеОтпуска
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников Из ВКМ_ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрокаОтпускаСотрудников.ВКМ_Сотрудник;
		Движение.ВКМ_ДатаНачалаОтпуска = ТекСтрокаОтпускаСотрудников.ВКМ_ДатаНачало;
		Движение.ВКМ_ОтпускПлан = (ТекСтрокаОтпускаСотрудников.ВКМ_ДатаОкончания-ТекСтрокаОтпускаСотрудников.ВКМ_ДатаНачало+86400)/86400;
	КонецЦикла;

КонецПроцедуры  

#КонецОбласти


//конец дорабтки