//Начало доработки Барышникова Ю.А 12.11.2024


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим) 
	
 
	// регистр ВКМ_ПлановыеОтпуска
	
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников Из ВКМ_ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник;
		Движение.ВКМ_ДатаНачало = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачало;
		Движение.ВКМ_ОтпускПлан = (ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания-ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачало+86400)/86400;
	КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#КонецЕсли

//конец дорабтки