#Область  ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДоговора = Перечисления .ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание
		И  Не ЗначениеЗаполнено(ВКМ_НачалоДействияДоговора) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст =  "Не указана дата начала договора";
		Сообщение.Сообщить();
		Отказ  =  Истина ;
	КонецЕсли ;

	Если ВидДоговора =  Перечисления .ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание
		И Не ЗначениеЗаполнено(ВКМ_КонецДействияДоговора) Тогда
		Сообщение  =  Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана дата окончания договора";
		Сообщение.Сообщить();
		Отказ  =  Истина ;
	КонецЕсли ;
КонецПроцедуры
#КонецОбласти