

//НачалоДоработки. Барышникова Ю.А. Программное выведение по форме реквизитов договора обслуживания
#Область ОбработчикиСобытийФормы






&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НовыйЭлемент  = Элементы.Добавить( "НачалоДействия" ,Тип ( "ПолеФормы" ));
	НовыйЭлемент.ПутьКДанным =  "Список.ВКМ_НачалоДействияДоговора"; 
	НовыйЭлемент.Вид= ВидПоляФормы.ПолеВвода ;
	НовыйЭлемент.Заголовок =  "Начало действия" ;

	НовыйЭлемент  = Элементы.Добавить("КонецДействия" , Тип ( "ПолеФормы" ));
	НовыйЭлемент.ПутьКДанным = "Список.ВКМ_КонецДействияДоговора" ; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода ;
	НовыйЭлемент.Заголовок =  "Конец действия" ;

	НовыйЭлемент  = Элементы.Добавить("СуммаАбоненскойПлаты",  Тип ( "ПолеФормы" ));
	НовыйЭлемент.ПутьКДанным =  "Список.ВКМ_СуммаАбоненскойПлаты"; 
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода ;
	НовыйЭлемент.Заголовок =  "Абонентская плата" ;

	НовыйЭлемент  = Элементы.Добавить( "СтоимостьЧасаРаботы" ,  Тип ( "ПолеФормы" ));
	НовыйЭлемент.ПутьКДанным  =  "Список.ВКМ_СтоимостьЧасаРаботы" ; 
	НовыйЭлемент.Вид= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок =  "Часовая ставка";

	Если  НЕ Список.ВидДоговора =  Перечисления .ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда  
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Ложь ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Ложь ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь ; 
	Иначе 	
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость = Истина ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Истина ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина ; 
	КонецЕсли ;

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если  НЕ Список.ВидДоговора =  Перечисления .ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда  
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Ложь ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Ложь ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Ложь ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Ложь ; 
	Иначе 	
		Элементы.ВКМ_НачалоДействияДоговора.Видимость =  Истина ;  
		Элементы.ВКМ_КонецДействияДоговора.Видимость =  Истина ;    
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость =  Истина ;    
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость =  Истина ; 
	КонецЕсли ;

КонецПроцедуры
#КонецОбласти
