//доработка 10.11.2024 Барышникова Ю.А
/////////////////////////////////////////////////// /////////////////////////////////////////////////// ///
// Copyright(c)2021, ООО «1С-Софт»
// Все права защищены. Эта программа и сопутствующие материалы прилагаются.
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
/////////////////////////////////////////////////// /////////////////////////////////////////////////// ///

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область  ПрограммныйИнтерфейс

#Область  ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые разрешены властями
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
// Массив из Строка
//
функция  РеквизитыРедактируемыеВГрупповойОбработке () Экспорт

	Возврат ОбщегоНазначения.ОбщийМодуль( "РаботаСФайлами" ).РеквизитыРедактируемыеВГрупповойОбработке() ;

КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
// Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура  ПриЗаполненииОграниченияДоступа ( Ограничение ) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	| ЧтениеОбъектаРазрешено(ВладелецФайла);
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	| ИзменениеОбъектаРазрешено(ВладелецФайла)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли