
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

//08.11 Барышникова Ю.А начало Добавьте регистр накопления для хранения информации о суммах 
//задолженности клиента ВыполненныеКлиентуРабот

Процедура ОбработкаПроведения(Отказ, Режим)
	
    Если Дата >= ВКМ_Договор.ВКМ_КонецДействияДоговора или Дата <= ВКМ_Договор.ВКМ_НачалоДействияДоговора Тогда
     Сообщить( "Дата документа выходить за грани действия договора");
      Отказ =Истина;  

	  КонецЕсли;
    
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из ВыполненныеРаботы Цикл
		
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ТекСтрокаТовары.ВКМ_ФактическиПотраченоЧасов;
	Движение.ВКМ_СуммаКОплате = ТекСтрокаТовары.ВКМ_ЧасыКОплатеКлиенту * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
#КонецЕсли
///конец доработки