#Область ОбработчикиСобытий
//08.11 начало Добавьте регистр накопления для хранения информации о суммах 
//задолженности клиента ВыполненныеКлиентуРаботы
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ВКМ_ФактическиПотраченоЧасов;
	Движение.ВКМ_СуммаКОплате = ВКМ_ЧасыКОплатеКлиенту;

КонецПроцедуры

#КонецОбласти
