#Область ОбработчикиСобытий
//08.11 начало Добавьте регистр накопления для хранения информации о суммах 
//задолженности клиента ВыполненныеКлиентуРаботы
Процедура ОбработкаПроведения(Отказ, Режим)
	
    Если Дата >= ВКМ_Договор.ВКМ_КонецДействияДоговора или Дата <= ВКМ_Договор.ВКМ_НачалоДействияДоговора Тогда
     Сообщить( "Дата документа выходить за грани действия договора");
      Отказ =Истина;  

	  КонецЕсли;
    
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из ВыполненныеРаботы Цикл
		
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Клиент = ВКМ_Клиент;
	Движение.ВКМ_Договор = ВКМ_Договор;
	Движение.ВКМ_КоличествоЧасов = ТекСтрокаТовары.ВКМ_ФактическиПотраченоЧасов;
	Движение.ВКМ_СуммаКОплате = ТекСтрокаТовары.ВКМ_ЧасыКОплатеКлиенту * ВКМ_Договор.ВКМ_СтоимостьЧасаРаботы;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти